In [2]:
import pandas as pd
Titanic_dummy = pd.read_csv("data/Titanic_dummy.csv")
print(Titanic_dummy)

          Sex  Age  Survived
0        Male    6         1
1        Male   17         1
2      Female   51         0
3  Non-binary   44         0
4      Female   34         1
5      Female   67         1
6        Male   24         1
7  Non-binary   31         1
8        Male   10         0
9      Female   48         0

In [3]:
Titanic_dummy.columns

Index(['Sex', 'Age', 'Survived'], dtype='object')

In [4]:
Titanic_dummy.info()
Titanic_dummy.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       10 non-null     object
 1   Age       10 non-null     int64
 2   Survived  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

             Age   Survived
count  10.000000  10.000000
mean   33.200000   0.600000
std    19.509542   0.516398
min     6.000000   0.000000
25%    18.750000   0.000000
50%    32.500000   1.000000
75%    47.000000   1.000000
max    67.000000   1.000000

In [5]:
Titanic_dummy.head()

          Sex  Age  Survived
0        Male    6         1
1        Male   17         1
2      Female   51         0
3  Non-binary   44         0
4      Female   34         1

In [6]:
Titanic_dummy = pd.read_csv("data/Titanic_dummy.csv")
print(Titanic_dummy)

          Sex  Age  Survived
0        Male    6         1
1        Male   17         1
2      Female   51         0
3  Non-binary   44         0
4      Female   34         1
5      Female   67         1
6        Male   24         1
7  Non-binary   31         1
8        Male   10         0
9      Female   48         0

In [7]:
pd.isna(Titanic_dummy)

     Sex    Age  Survived
0  False  False     False
1  False  False     False
2  False  False     False
3  False  False     False
4  False  False     False
5  False  False     False
6  False  False     False
7  False  False     False
8  False  False     False
9  False  False     False

In [8]:
import pandas as pd
Titanic_dummy = pd.read_csv("data/Titanic_dummy.csv")
Titanic_dummy["Age"].fillna(Titanic_dummy["Age"].mean(), inplace=True)